In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [2]:
n_rows =10
n_cols=5

cols = tuple('ABCDE')

df=pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns = cols)
df

    A   B   C   D   E
0   1  11  18  19  13
1  17   5  16  11   6
2  14  11  19  18   9
3   1   4  12   6  10
4  14  16   8  10  14
5  16  15   4   6   7
6  14   8   3  13   6
7  18   1  16   6   1
8   3   2   3  18   5
9   6  15  10  12  10

In [3]:
#Untuk mengecek shape/bentuk dari data frame yang kita miliki
df.shape

(10, 5)

In [6]:
#untuk memilih berapa yang akan dibagi
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [7]:
df_1 #nilai yang terbentuk akan tetap acak, terbentuk dari df sebelumnya

    A   B   C   D   E
7  18   1  16   6   1
6  14   8   3  13   6
8   3   2   3  18   5
0   1  11  18  19  13
9   6  15  10  12  10
4  14  16   8  10  14
1  17   5  16  11   6

In [8]:
df_2 #nilai yang terbentuk juga acak, terbentuk dari df sebelumnya

    A   B   C   D   E
2  14  11  19  18   9
3   1   4  12   6  10
5  16  15   4   6   7